```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_kms_alias.dnssec will be destroyed
  # (because aws_kms_alias.dnssec is not in configuration)
  - resource "aws_kms_alias" "dnssec" {
      - arn            = "arn:aws:kms:us-east-1:098453759506:alias/dnssec" -> null
      - id             = "alias/dnssec" -> null
      - name           = "alias/dnssec" -> null
      - target_key_arn = "arn:aws:kms:us-east-1:098453759506:key/a6b7ce49-4e71-4d81-b986-d5943747d37e" -> null
      - target_key_id  = "a6b7ce49-4e71-4d81-b986-d5943747d37e" -> null
    }

  # aws_kms_alias.main will be destroyed
  # (because aws_kms_alias.main is not in configuration)
  - resource "aws_kms_alias" "main" {
      - arn            = "arn:aws:kms:ap-southeast-1:098453759506:alias/main" -> null
      - id             = "alias/main" -> null
      - name           = "alias/main" -> null
      - target_key_arn = "arn:aws:kms:ap-southeast-1:098453759506:key/d101c43b-18ba-458a-b25c-d75bcd968212" -> null
      - target_key_id  = "d101c43b-18ba-458a-b25c-d75bcd968212" -> null
    }

  # aws_kms_key.terraform_state will be created
  + resource "aws_kms_key" "terraform_state" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "Terraform State"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

Plan: 1 to add, 0 to change, 2 to destroy.

```
